import { HistoryItem } from "../Types/history";

export const historyData: HistoryItem[] = [
  {
    id: 1,
    years: "2007 : 2010",
    content: "2004: بدأ الدكتور مصطفى سليم عمله الصحفي في 'اندبندنت عربية'.",
  },
  {
    id: 2,
    years: "2007 : 2010",
    content: "حصل الدكتور مصطفى سليم على الماجستير في الأدب العربي القديم من كلية دار العلوم. بدأ كتابة مقالات ودراسات نقدية في مجلة 'الثقافة الجديدة' ومواقع أخرى مثل 'رصيف 22'.",
  },
  {
    id: 3,
    years: "2011 : 2014",
    content: "حصل على الماجستير بتقدير امتياز في الأدب العربي القديم. فازت روايته 'سفر المرايا' بجائزة دبي الثقافية. فاز بجائزة كتاب اليوم للقصة القصيرة عن قصة 'المسكونة'.",
  },
  {
    id: 4,
    years: "2015 : 2019",
    content: "صدر روايه 'سفر المرايا' التي حصلت على جائزة دبي الثقافية. الدكتوراة في النقد الأدبي الحديث من جامعة عين شمس. صدرت كتب 'المناظرة والحجاج' و 'السلطة والحرية'.",
  },
  {
    id: 5,
    years: "2020 : 2025",
    content: "صدرت مجموعته القصصية 'نفق سري'. صدرت روايته 'الليالي العمياء'. تم إدراج 'الليالي العمياء' في القائمة الطويلة لجائزة كتارا للرواية العربية.",
  }
];